backend/load-tests/basic-flow.yml
config:
  target: "http://localhost:4000"
  phases:
    - duration: 60
      arrivalRate: 1
      name: Warm up
    - duration: 120
      arrivalRate: 1
      rampTo: 5
      name: Ramp up load
    - duration: 300
      arrivalRate: 5
      name: Sustained load
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99: 100
      - http.response_time.p95: 50
scenarios:
  - flow:
      - get:
          url: "/"
      - get:
          url: "/calendar/feed"