backend/load-tests/smoke.yml
config:
  target: "http://localhost:4000"
  phases:
    - duration: 10
      arrivalRate: 1
      name: Smoke Test
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99: 100
      - http.response_time.p95: 75
scenarios:
  - flow:
      - get:
          url: "/"
      - get:
          url: "/calendar/feed"